# 4.4Data Wrangling and Subsetting

## Contents

1- Wrangling Procedures

2- Changing Numerical Data Types

3- Changing an Unintuitive Column Name

4- Finding the Busiest Hours for Placing Orders

5- Determing the Value of '4' in the department_id Column

6- Information about Breakfast Item Sales

7- Finding Details Related to Dinner Parties

8- Finding Counts for the New Dinner Party DataFrame

9- All Information about user_id: '1'

10- Export orders_wrangled.csv DataFrame

11- Export the df_dep_t_new dataframe as “departments_wrangled.csv”

In [1]:
import pandas as pd
import os
import numpy as np

In [3]:
path = r'/Users/calebhill/09:01:2023 - Instacart Basket Analysis'

In [18]:
df_prod = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [19]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)

In [20]:
df_dep = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'departments.csv'), index_col = False)

## 1) Wrangling Procedures

In [125]:
#removes column
df_ords = df_ords.drop(columns = ['eval_set'])

In [21]:
#provides the count of each variable in days_since_prior_order column
df_ords['days_since_prior_order'].value_counts(dropna = False)

days_since_prior_order
30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: count, dtype: int64

In [22]:
#renames column
df_ords.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True)

In [23]:
df_ords.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [28]:
#Changes Datatype for order_id
df_ords['order_id'] = df_ords['order_id'].astype('str')

In [32]:
#confirms that datatype has been changed
print(df_ords['order_id'].dtype)

object
object

In [34]:
#Transposes df_dep
df_dep_t = df_dep.T

In [35]:
df_dep_t

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [36]:
#adds an index
df_dep_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [37]:
#takes the first row or dp_dep_t as the header
new_header = df_dep_t.iloc[0]

In [38]:
new_header

0    department
Name: department_id, dtype: object

In [39]:
#creates a copy of all the rows after one of the data frame
df_dep_t_new = df_dep_t[1:]

In [41]:
df_dep_t_new

                  0
1            frozen
2             other
3            bakery
4           produce
5           alcohol
6     international
7         beverages
8              pets
9   dry goods pasta
10             bulk
11    personal care
12     meat seafood
13           pantry
14        breakfast
15     canned goods
16       dairy eggs
17        household
18           babies
19           snacks
20             deli
21          missing

In [42]:
#adds the header to the columns in the dataframe
df_dep_t_new.columns = new_header

In [43]:
df_dep_t_new

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [45]:
df_prod.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [46]:
#turns df_dep_t_new into a data dictionary
data_dict = df_dep_t_new.to_dict('index')

In [123]:
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

In [54]:
print(data_dict.get('19'))

{'department': 'snacks'}

In [126]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

## 2) Changing Numerical Data Types

In [127]:
#changes the column: order_number to a string
df_ords['user_id'] = df_ords['user_id'].astype('str')

In [130]:
#confirms that the datatype is object
print(df_ords['user_id'].dtype)

object

## 3) Changing an Unintuitive Column Name

In [131]:
df_ords.rename(columns = {'days_since_prior_order' : 'days_since_last_order'}, inplace = True)

## 4) Finding the Busiest Hours for Placing Orders

In [170]:
#finds the hour where most orders are placed
df_ords['order_hour_of_day'].value_counts(dropna = False).head(1)

order_hour_of_day
10    288418
Name: count, dtype: int64

In [ ]:
#the busiest hour for placing orders is 10

## 5) Determing the Value of "4" in the department_id Column

In [145]:
#prints the value of 4 in the data dictionary
print(data_dict.get('4')['department'])

produce

## 6) Information about Breakfast Item Sales.

In [163]:
df_breakfast_prods = df_prod.loc[df_prod['department_id'].isin([14])]

In [164]:
df_breakfast_prods.head()

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6

## 7) Finding Details Related to Dinner parties

In [158]:
#produces a subset with only alcohol, deli, beverages and meat/seafood products; sorted by department_id
df_dinner_party_prods = df_prod.loc[df_prod['department_id'].isin([5,7,12,20])].sort_values('department_id')

In [165]:
df_dinner_party_prods.head()

,product_id,product_name,aisle_id,department_id,prices
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
36276,36272,Kali Hart Pinot Noir,28,5,11.6
10802,10802,Diamond Junmai Ginjo Saké,134,5,9.5
10702,10702,California Red Wine,28,5,3.0
36423,36419,Cashmere,28,5,9.5

## 8) Finding Counts for the New Dinner Party DataFrame

In [169]:
#provides the row count of df_dinner_party_prods
print(f'{df_dinner_party_prods.shape[0]} rows in the dinner party dataframe')

7650 rows in the dinner party dataframe

## 9) All information about user_id: "1"

In [171]:
#pulls the statistacl information on user_id: 1
df_ords.loc[df_ords['user_id']=='1'].describe()

       orders_day_of_week  order_hour_of_day  days_since_last_order
count           11.000000          11.000000              10.000000
mean             2.636364          10.090909              19.000000
std              1.286291           3.477198               9.030811
min              1.000000           7.000000               0.000000
25%              1.500000           7.500000              14.250000
50%              3.000000           8.000000              19.500000
75%              4.000000          13.000000              26.250000
max              4.000000          16.000000              30.000000

## 10) Export orders_wrangled.csv data frame.

In [172]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled.csv'))

## 11) Export the df_dep_t_new dataframe as “departments_wrangled.csv”

In [173]:
df_dep_t_new.to_csv(os.path.join(path, '02 Data','Prepared Data', 'departments_wrangled.csv'))